---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.Dispose
source: html/3ce4d82f-7f24-8ee9-bf28-f9b49f113971.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.Dispose Method

Releases all resources used by the ExportLayerInfo

## Syntax (C#)
```csharp
public void Dispose()
```